# -*- coding: utf-8 -*-
# @Time    : 2019-08-08  00:18
# @File    : 1.基础语法.py
# @Author  : 啊啊

'''
标识符
1.第一个标号必须是字母或者是下划线‘-’
2.标识符的其他部分由字母、数字和下划线组成。
3.标识符对字母大小写敏感
'''

'''
保留字
也就是关键字，我们不能把他们用作标识符。
'''
import keyword
# print(keyword.kwlist)

'''
注释
1. 用 #
2. 多行注释可以用多个 # 号，还有 \''' 和 """
'''

'''
缩进
python使用缩进来表示代码块，不需要使用{}
缩进的空格数是可变的，但是同一个代码块的语句必须包含相同的缩进空格数。
'''

'''
多行语句 \
Python 通常是一行写完一条语句，但如果语句很长，我们可以使用反斜杠(\)来实现多行语句，
'''

'''
数字(Number)类型
python中数字有四种类型：整数、布尔型、浮点数和复数。
int (整数), 如 1, 只有一种整数类型 int，表示为长整型，没有 python2 中的 Long。
bool (布尔), 如 True。
float (浮点数), 如 1.23、3E-2
complex (复数), 如 1 + 2j、 1.1 + 2.2j
'''

'''
字符串(String)

'''